MikroElektronika/mikrosdk_v2/targets/pic_16bit/mikroe/dspic/include/pps/hal_ll_pps_connection_defs/dsPIC33EP512GM604/hal_ll_pps_connection_defs.h
    {GPIO_PIN_2, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 34, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RB3_RP35
    {GPIO_PIN_3, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 35, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RB4_RP36
    {GPIO_PIN_4, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 36, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RB5_RP37
    {GPIO_PIN_5, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 37, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RB6_RP38
    {GPIO_PIN_6, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 38, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RB7_RP39
    {GPIO_PIN_7, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 39, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RB8_RP40
    {GPIO_PIN_8, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 40, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RB9_RP41
    {GPIO_PIN_9, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 41, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RC0_RP48
    {GPIO_PIN_0, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 48, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RC1_RP49
    {GPIO_PIN_1, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 49, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RC2_RPI50
    {GPIO_PIN_2, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 50, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RC3_RPI51
    {GPIO_PIN_3, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 51, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RC4_RPI52
    {GPIO_PIN_4, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 52, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RC5_RPI53
    {GPIO_PIN_5, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 53, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RC6_RP54
    {GPIO_PIN_6, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 54, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RC7_RP55
    {GPIO_PIN_7, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 55, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RC8_RP56
    {GPIO_PIN_8, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 56, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef UART4_RX_RC9_RP57
    {GPIO_PIN_9, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 57, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA0_RPI16
    {GPIO_PIN_0, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 16, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA1_RPI17
    {GPIO_PIN_1, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 17, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA2_RPI18
    {GPIO_PIN_2, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 18, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA3_RPI19
    {GPIO_PIN_3, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 19, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA4_RP20
    {GPIO_PIN_4, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 20, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA8_RPI24
    {GPIO_PIN_8, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 24, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA9_RPI25
    {GPIO_PIN_9, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 25, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB0_RPI32
    {GPIO_PIN_0, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 32, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB1_RPI33
    {GPIO_PIN_1, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 33, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB10_RP42
    {GPIO_PIN_10, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 42, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB11_RP43
    {GPIO_PIN_11, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 43, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB12_RPI44
    {GPIO_PIN_12, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 44, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB13_RPI45
    {GPIO_PIN_13, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 45, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB14_RPI46
    {GPIO_PIN_14, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 46, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB15_RPI47
    {GPIO_PIN_15, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 47, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB2_RPI34
    {GPIO_PIN_2, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 34, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB3_RP35
    {GPIO_PIN_3, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 35, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB4_RP36
    {GPIO_PIN_4, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 36, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB5_RP37
    {GPIO_PIN_5, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 37, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB6_RP38
    {GPIO_PIN_6, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 38, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB7_RP39
    {GPIO_PIN_7, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 39, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB8_RP40
    {GPIO_PIN_8, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 40, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB9_RP41
    {GPIO_PIN_9, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 41, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC0_RP48
    {GPIO_PIN_0, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 48, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC1_RP49
    {GPIO_PIN_1, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 49, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC2_RPI50
    {GPIO_PIN_2, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 50, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC3_RPI51
    {GPIO_PIN_3, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 51, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC4_RPI52
    {GPIO_PIN_4, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 52, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC5_RPI53
    {GPIO_PIN_5, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 53, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC6_RP54
    {GPIO_PIN_6, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 54, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC7_RP55
    {GPIO_PIN_7, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 55, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC8_RP56
    {GPIO_PIN_8, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 56, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC9_RP57
    {GPIO_PIN_9, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 57, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR22_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RA0_RPI16
    {GPIO_PIN_0, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 16, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RA1_RPI17
    {GPIO_PIN_1, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 17, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RA2_RPI18
    {GPIO_PIN_2, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 18, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RA3_RPI19
    {GPIO_PIN_3, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 19, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RA4_RP20
    {GPIO_PIN_4, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 20, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RA8_RPI24
    {GPIO_PIN_8, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 24, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RA9_RPI25
    {GPIO_PIN_9, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 25, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB0_RPI32
    {GPIO_PIN_0, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 32, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB1_RPI33
    {GPIO_PIN_1, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 33, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB10_RP42
    {GPIO_PIN_10, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 42, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB11_RP43
    {GPIO_PIN_11, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 43, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB12_RPI44
    {GPIO_PIN_12, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 44, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB13_RPI45
    {GPIO_PIN_13, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 45, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB14_RPI46
    {GPIO_PIN_14, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 46, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB15_RPI47
    {GPIO_PIN_15, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 47, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB2_RPI34
    {GPIO_PIN_2, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 34, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB3_RP35
    {GPIO_PIN_3, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 35, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB4_RP36
    {GPIO_PIN_4, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 36, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB5_RP37
    {GPIO_PIN_5, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 37, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB6_RP38
    {GPIO_PIN_6, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 38, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB7_RP39
    {GPIO_PIN_7, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 39, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB8_RP40
    {GPIO_PIN_8, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 40, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB9_RP41
    {GPIO_PIN_9, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 41, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC0_RP48
    {GPIO_PIN_0, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 48, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC1_RP49
    {GPIO_PIN_1, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 49, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC2_RPI50
    {GPIO_PIN_2, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 50, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC3_RPI51
    {GPIO_PIN_3, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 51, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC4_RPI52
    {GPIO_PIN_4, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 52, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC5_RPI53
    {GPIO_PIN_5, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 53, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC6_RP54
    {GPIO_PIN_6, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 54, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC7_RP55
    {GPIO_PIN_7, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 55, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC8_RP56
    {GPIO_PIN_8, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 56, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC9_RP57
    {GPIO_PIN_9, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 57, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif

    { HAL_LL_PIN_NC, HAL_LL_PORT_NC, HAL_LL_PIN_NC, HAL_LL_PIN_NC, HAL_LL_PIN_NC, HAL_LL_MODULE_ERROR, HAL_LL_MODULE_ERROR }
};

